// 偽林檎　エラーメッセージ文字列
// #nは表示する前に置き換えられます。

/*
    SCFoundation
*/
foundation.installer.zipException = "A ZipException has occured. The archive may be broken or not a zip file.";
foundation.installer.ioException = "An IOException has occured. Couldn't open the archive.";
foundation.installer.descriptionNotFound = "INSTALL/1.0 definition file \"install.txt\" was not found in the archive.";
foundation.installer.undefinedType = "The definition file specifies unknown type \"#1\".";
foundation.installer.couldNotMakeFile = "An error has occured in installing. Couldn't create some files.";
foundation.installer.supplementRefused = "This archive is a supplement for the ghost \"#1\".";
foundation.installer.supplementTargetNotBooted = "The ghost \"#1\" target of the supplement has not been booted up.";


/*
    SCScriptRunner
*/
scriptrunner.handlerNotFound = "Handler \"[#1]\" was not found.";


/*
    SCNetworkUpdater
*/
networkupdater.serverReturnedError = "The server returned #1.";
networkupdater.unexpectedError = "Updater failed in updating because of #1.";